ОсновныеОбъектыЗанятие6/src/DataProcessors/ЗаполнениеКурсаВалюты/ЗаполнениеКурсаВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗаполнениеКурсаВалюты</name>
</mdclass:DataProcessor>

ОсновныеОбъектыЗанятие6/src/InformationRegisters/ОтносительныеКурсыВалют/ОтносительныеКурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтносительныеКурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КурсЧислитель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КурсЗнаменатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>БазоваяВалюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОсновныеОбъектыЗанятие6/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКурса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ОсновныеОбъектыЗанятие6/src/DataProcessors/ЗаполнениеКурсаВалюты/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Установить(Команда)
	
	Данные = Новый СписокЗначений();
	Данные.Добавить(Период);
	Данные.Добавить(Валюта);
	Данные.Добавить(КурсЧислитель);
	Данные.Добавить(КурсЗнаменатель);
	Данные.Добавить(Сотрудник);
	
	УстановитьСервер(Данные, БуквенныйКод);
	
	Сообщить("Курс валюты " + БуквенныйКод + " установлен");

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСервер(Данные, БуквенныйКод)
		
	Если ЗначениеЗаполнено(Данные.Получить(1).Значение) Тогда

		ЗаписьРегистраСведений = РегистрыСведений.ОтносительныеКурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьРегистраСведений.Период = Данные.Получить(0).Значение;
		ЗаписьРегистраСведений.Валюта = Данные.Получить(1).Значение;
		ЗаписьРегистраСведений.БазоваяВалюта = Справочники.Валюты.НациональнаяВалюта;
		ЗаписьРегистраСведений.КурсЧислитель = Данные.Получить(2).Значение;
		ЗаписьРегистраСведений.КурсЗнаменатель = ?(Данные.Получить(3).Значение = 0, 1, Данные.Получить(3).Значение);
		ЗаписьРегистраСведений.Ответственный = Данные.Получить(4).Значение;

		Попытка
			ЗаписьРегистраСведений.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
			Возврат;
		КонецПопытки;
		
		
		БуквенныйКод =  Данные.Получить(1).Значение.БуквенныйКод;

	КонецЕсли;
	
	
КонецПроцедуры
